#/*
#
# Copyright (c) 2006-2020 Microsemi Corporation "Microsemi". All Rights Reserved.
#
# Unpublished rights reserved under the copyright laws of the United States of
# America, other countries and international treaties. Permission to use, copy,
# store and modify, the software and its source code is granted but only in
# connection with products utilizing the Microsemi switch and PHY products.
# Permission is also granted for you to integrate into other products, disclose,
# transmit and distribute the software only in an absolute machine readable
# format (e.g. HEX file) and only in or with products utilizing the Microsemi
# switch and PHY products.  The source code of the software may not be
# disclosed, transmitted or distributed without the prior written permission of
# Microsemi.
#
# This copyright notice must appear in any copy, modification, disclosure,
# transmission or distribution of the software.  Microsemi retains all
# ownership, copyright, trade secret and proprietary rights in the software and
# its source code, including all modifications thereto.
#
# THIS SOFTWARE HAS BEEN PROVIDED "AS IS". MICROSEMI HEREBY DISCLAIMS ALL
# WARRANTIES OF ANY KIND WITH RESPECT TO THE SOFTWARE, WHETHER SUCH WARRANTIES
# ARE EXPRESS, IMPLIED, STATUTORY OR OTHERWISE INCLUDING, WITHOUT LIMITATION,
# WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR USE OR PURPOSE AND
# NON-INFRINGEMENT.
#
#*/

===========
#Router-1
===========
hostname R1
vlan 1,100,200,300,400
ip routing
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface vlan 100
ip address 1.0.2.1 255.255.255.0

interface vlan 200
ip address 1.0.4.1 255.255.255.0

interface vlan 300
ip address 1.1.10.1 255.255.255.0

interface vlan 400
ip address 1.1.11.1 255.255.255.0
router ospf
router-id 0.0.0.1
network 1.0.2.0 0.0.0.255 area 0.0.0.0
network 1.0.4.0 0.0.0.255 area 0.0.0.0
network 1.1.10.0 0.0.0.255 area 0.0.0.1
network 1.1.11.0 0.0.0.255 area 0.0.0.1


===========
#Router-2
===========
hostname R2
vlan 1,100,200,300,400,500,600
ip routing
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface GigabitEthernet 1/5
switchport access vlan 500
no spanning-tree

interface GigabitEthernet 1/6
switchport access vlan 600
no spanning-tree

interface vlan 100
ip address 1.0.1.2 255.255.255.0

interface vlan 200
ip address 1.0.2.2 255.255.255.0

interface vlan 300
ip address 1.2.5.2 255.255.255.0

interface vlan 400
ip address 1.2.6.2 255.255.255.0

interface vlan 500
ip address 1.7.19.2 255.255.255.0

interface vlan 600
ip address 1.7.20.2 255.255.255.0

router ospf
router-id 0.0.0.2
network 1.0.1.0 0.0.0.255 area 0.0.0.0
network 1.0.2.0 0.0.0.255 area 0.0.0.0
network 1.2.5.0 0.0.0.255 area 0.0.0.2
network 1.2.6.0 0.0.0.255 area 0.0.0.2
network 1.7.19.0 0.0.0.255 area 0.0.0.7
network 1.7.20.0 0.0.0.255 area 0.0.0.7
area 0.0.0.2 stub no-summary
area 0.0.0.7 nssa no-summary


===========
#Router-3
===========
hostname R3
vlan 1,100,200,300,400
ip routing
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface vlan 100
ip address 1.0.1.3 255.255.255.0

interface vlan 200
ip address 1.0.3.3 255.255.255.0

interface vlan 300
ip address 1.3.12.3 255.255.255.0

interface vlan 400
ip address 1.6.18.3 255.255.255.0

router ospf
router-id 0.0.0.3
network 1.0.1.0 0.0.0.255 area 0.0.0.0
network 1.0.3.0 0.0.0.255 area 0.0.0.0
network 1.3.12.0 0.0.0.255 area 0.0.0.3 
network 1.6.18.0 0.0.0.255 area 0.0.0.6
area 0.0.0.3 stub
area 0.0.0.6 nssa


===========
#Router-4
===========
hostname R4
vlan 1,100,200,300,400
ip routing
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface vlan 100
ip address 1.0.3.4 255.255.255.0

interface vlan 200
ip address 1.0.4.4 255.255.255.0

interface vlan 300
ip address 1.4.14.4 255.255.255.0

interface vlan 400
ip address 1.4.15.4 255.255.255.0
router ospf
router-id 0.0.0.4
network 1.0.3.0 0.0.0.255 area 0.0.0.0
network 1.0.4.0 0.0.0.255 area 0.0.0.0
network 1.4.14.0 0.0.0.255 area 0.0.0.4
network 1.4.15.0 0.0.0.255 area 0.0.0.4 
area 4 virtual-link 0.0.0.41
area 4 virtual-link 0.0.0.42


===========
#Router-12
===========
!--General configuration
hostname R12
vlan 300,400
ip routing

!--Interface configuration
interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface vlan 300
ip address 1.1.7.12 255.255.255.0

interface vlan 400
ip address 1.1.8.12 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.12
network 1.1.7.0 0.0.0.255 area 0.0.0.1
network 1.1.8.0 0.0.0.255 area 0.0.0.1


===========
#Router-13
===========
!--General configuration
hostname R13
vlan 300,400
ip routing

!--Interface configuration
interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface vlan 300
ip address 1.1.7.13 255.255.255.0

interface vlan 400
ip address 1.1.11.13 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.13
network 1.1.7.0 0.0.0.255 area 0.0.0.1
network 1.1.11.0 0.0.0.255 area 0.0.0.1
max-metric router-lsa administrative


===========
#Router-14
===========
!--General configuration
hostname R14
vlan 100,200
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface vlan 100
ip address 1.1.10.14 255.255.255.0

interface vlan 200
ip address 1.1.9.14 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.14
network 1.1.9.0 0.0.0.255 area 0.0.0.1
network 1.1.10.0 0.0.0.255 area 0.0.0.1


===========
#Router-15
===========
!--General configuration
hostname R15
vlan 100,200,300
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface vlan 100
ip address 1.1.8.15 255.255.255.0

interface vlan 200
ip address 1.1.9.15 255.255.255.0

interface vlan 300
ip address 1.99.1.15 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.15
redistribute connected
network 1.1.8.0 0.0.0.255 area 0.0.0.1
network 1.1.9.0 0.0.0.255 area 0.0.0.1
!


===========
#Router-21
===========
!--General configuration
hostname R21
vlan 100,200
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface vlan 100
ip address 1.2.5.21 255.255.255.0

interface vlan 200
ip address 1.2.6.21 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.21
network 1.2.5.0 0.0.0.255 area 0.0.0.2
network 1.2.6.0 0.0.0.255 area 0.0.0.2
area 0.0.0.2 stub


===========
#Router-31
===========
!--General configuration
hostname R31
vlan 100
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface vlan 100
ip address 1.3.12.31 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.31
network 1.3.12.0 0.0.0.255 area 3
area 0.0.0.3 stub


===========
#Router-41
===========
!--General configuration
hostname R41
vlan 100,200
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface vlan 100
ip address 1.4.15.41 255.255.255.0

interface vlan 200
ip address 1.5.16.41 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.41
network 1.4.15.0 0.0.0.255 area 0.0.0.4
network 1.5.16.0 0.0.0.255 area 0.0.0.5
area 0.0.0.4 virtual-link 0.0.0.4


===========
#Router-42
===========
!--General configuration
hostname R42
vlan 300,400
ip routing

!--Interface configuration
interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface GigabitEthernet 1/4
switchport access vlan 400
no spanning-tree

interface vlan 300
ip address 1.4.14.42 255.255.255.0

interface vlan 400
ip address 1.0.17.42 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.42
network 1.0.17.0 0.0.0.255 area 0.0.0.0
network 1.4.14.0 0.0.0.255 area 0.0.0.4
area 0.0.0.4 virtual-link 0.0.0.4



===========
#Router-61
===========
!--General configuration
hostname R61
vlan 100,200
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface vlan 100
ip address 1.6.18.61 255.255.255.0

interface vlan 200
ip address 1.98.1.61 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.61
redistribute connected
network 1.6.18.0 0.0.0.255 area 0.0.0.6
area 0.0.0.6 nssa

===========
#Router-71
===========
!--General configuration
hostname R71
vlan 100,200,300
ip routing

!--Interface configuration
interface GigabitEthernet 1/1
switchport access vlan 100
no spanning-tree

interface GigabitEthernet 1/2
switchport access vlan 200
no spanning-tree

interface GigabitEthernet 1/3
switchport access vlan 300
no spanning-tree

interface vlan 100
ip address 1.7.19.71 255.255.255.0

interface vlan 200
ip address 1.7.20.71 255.255.255.0

interface vlan 300
ip address 1.97.1.71 255.255.255.0

!--OSPF router configuration
router ospf
ospf router-id 0.0.0.71
redistribute connected
network 1.7.19.0 0.0.0.255 area 0.0.0.7
network 1.7.20.0 0.0.0.255 area 0.0.0.7
area 0.0.0.7 nssa

